cmsis-svd/cmsis-svd/data/NXP/LPC800.svd
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>IDLE_CH</name>				
		<description>Idle channel register. This register returns the number of the first idle channel.</description>				
		<addressOffset>0xF4</addressOffset>				
		<access>read-only</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[3:0]</bitRange>		
			</field>			
			<field>			
				<name>CHAN</name>		
				<description>Idle channel. Reading the CHAN bits, returns the lowest idle timer channel. If all timer channels are running, CHAN = .</description>		
				<bitRange>[7:4]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[31:8]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>IRQ_FLAG</name>				
		<description>Global interrupt flag register</description>				
		<addressOffset>0xF8</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>GFLAG0</name>		
				<description>Monitors the interrupt flag of TIMER0.</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_PENDING_INTERRUPT</name>
						<description>No pending interrupt. Writing a zero is equivalent to no operation.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>PENDING_INTERRUPT_T</name>
						<description>Pending interrupt. The interrupt is pending because TIMER0 has reached the end of the time interval. If the INTEN bit in the CONTROL0 register is also set to 1, the interrupt for timer channel 0 and the global interrupt are raised.  Writing a 1 to this bit clears the interrupt request.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>GFLAG1</name>		
				<description>Monitors the interrupt flag of TIMER1.</description>		
				<bitRange>[1:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_PENDING_INTERRUPT</name>
						<description>No pending interrupt. Writing a zero is equivalent to no operation.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>PENDING_INTERRUPT_T</name>
						<description>Pending interrupt. The interrupt is pending because TIMER1 has reached the end of the time interval. If the INTEN bit in the CONTROL1 register is also set to 1, the interrupt for timer channel 1 and the global interrupt are raised.  Writing a 1 to this bit clears the interrupt request.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>GFLAG2</name>		
				<description>Monitors the interrupt flag of TIMER2.</description>		
				<bitRange>[2:2]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_PENDING_INTERRUPT</name>
						<description>No pending interrupt. Writing a zero is equivalent to no operation.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>PENDING_INTERRUPT_T</name>
						<description>Pending interrupt. The interrupt is pending because TIMER2 has reached the end of the time interval. If the INTEN bit in the CONTROL2 register is also set to 1, the interrupt for timer channel 2 and the global interrupt are raised.  Writing a 1 to this bit clears the interrupt request.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>GFLAG3</name>		
				<description>Monitors the interrupt flag of TIMER3.</description>		
				<bitRange>[3:3]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_PENDING_INTERRUPT</name>
						<description>No pending interrupt. Writing a zero is equivalent to no operation.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>PENDING_INTERRUPT_T</name>
						<description>Pending interrupt. The interrupt is pending because TIMER3 has reached the end of the time interval. If the INTEN bit in the CONTROL3 register is also set to 1, the interrupt for timer channel 3 and the global interrupt are raised.  Writing a 1 to this bit clears the interrupt request.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[31:4]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
</registers>						
							
																										

			
			
		</peripheral>
		<peripheral>
			<name>WKT</name>
			<description>Self wake-up timer (WKT)</description>
			<groupName>WKT</groupName>
			<baseAddress>0x40008000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>WKT</name>
				<value>15</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Self wake-up timer control register.</description>
					<addressOffset>0x0</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKSEL</name>
							<description>Select the self wake-up timer clock source.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DIVIDED_IRC_CLOCK_T</name>
									<description>Divided IRC clock. This clock runs at 750 kHz and provides time-out periods of up to approximately 95 minutes in 1.33 us increments. This clock is not available in most low-power modes and must not be selected if the timer is to be used to wake up from one of these modes.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_POWER_CLOCK_THI</name>
									<description>Low power clock. This is the (nominally) 10 kHz clock and provides time-out periods of up to approximately 119 hours in 100 CTS can be from the input pin, or fs increments. The accuracy of this clock is limited to +/- 45 % over temperature and processing. This clock is available in all power modes. Prior to use, the low-power oscillator must be enabled. The oscillator must also be set to remain active in Deep power-down if needed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALARMFLAG</name>
							<description>Wake-up or alarm timer flag.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_TIME_OUT_THE_SEL</name>
									<description>No time-out. The self wake-up timer has not timed out. Writing a 0 to has no effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIME_OUT_THE_SELF_W</name>
									<description>Time-out. The self wake-up timer has timed out. This flag generates an interrupt request which can wake up the part from any low power mode not deep power-down. Writing a 1 clears this status bit and the interrupt too?</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLEARCTR</name>
							<description>Clears the self wake-up timer.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_EFFECT_READING_T</name>
									<description>No effect. Reading this bit always returns 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_THE_COUNTER_C</name>
									<description>Clear the counter. Counting is halted until a new count value is loaded.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:3]</bitRange>
							
