cmsis-svd/cmsis-svd/data/NXP/LPC800.svd
			</field>			
		</fields>				
	</register>					
</registers>						

	
		</peripheral>
		<peripheral>
			<name>PMU</name>
			<description>Power Management Unit (PMU)</description>
			<groupName>PMU</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>						
				<register>					
					<name>PCON</name>				
					<description>Power control register</description>				
					<addressOffset>0x000</addressOffset>				
					<access>read-write</access>				
					<resetValue>0x0</resetValue>				
					<resetMask>0xFFFFFFFF</resetMask>				
					<fields>				
						<field>			
							<name>PM</name>		
							<description>Power mode</description>		
							<bitRange>[2:0]</bitRange>		
							<enumeratedValues>		
								<name>ENUM</name>		
								<enumeratedValue>	
									<name>DEFAULT_THE_PART_IS</name>
									<description>Default. The part is in active or sleep mode.</description>
									<value>0x0</value>
								</enumeratedValue>	
								<enumeratedValue>	
									<name>ARM_WFI_WILL_ENTER_D</name>
									<description>ARM WFI will enter Deep-sleep mode.</description>
									<value>0x1</value>
								</enumeratedValue>	
								<enumeratedValue>	
									<name>ARM_WFI_WILL_ENTER_P</name>
									<description>ARM WFI will enter Power-down mode.</description>
									<value>0x2</value>
								</enumeratedValue>	
								<enumeratedValue>	
									<name>ARM_WFI_WILL_ENTER_D</name>
									<description>ARM WFI will enter Deep-power down mode (ARM Cortex-M0 core powered-down).</description>
									<value>0x3</value>
								</enumeratedValue>	
							</enumeratedValues>		
						</field>			
						<field>			
							<name>NODPD</name>		
							<description>A 1 in this bit prevents entry to Deep power-down mode when 0x3 is written to the PM field above, the SLEEPDEEP bit is set, and a WFI is executed.   This bit is cleared only by power-on reset, so writing a one to this bit locks the part in a mode in which Deep power-down mode is blocked.</description>		
							<bitRange>[3:3]</bitRange>		
								
						</field>			
						<field>			
							<name>RESERVED</name>		
							<description>Reserved. Do not write ones to this bit.</description>		
							<bitRange>[7:4]</bitRange>		
								
						</field>			
						<field>			
							<name>SLEEPFLAG</name>		
							<description>Sleep mode flag</description>		
							<bitRange>[8:8]</bitRange>		
							<enumeratedValues>		
								<name>ENUM</name>		
								<enumeratedValue>	
									<name>READ_NO_POWER_DOWN_</name>
									<description>Read: No power-down mode entered. LPC11Uxx is in Active mode. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>	
								<enumeratedValue>	
									<name>READ_SLEEPDEEP_SLE</name>
									<description>Read: Sleep/Deep-sleep or Deep power-down mode entered. Write: Writing a 1 clears the SLEEPFLAG bit to 0.</description>
									<value>1</value>
								</enumeratedValue>	
							</enumeratedValues>		
						</field>			
						<field>			
							<name>RESERVED</name>		
							<description>Reserved. Do not write ones to this bit.</description>		
							<bitRange>[10:9]</bitRange>		
								
						</field>			
						<field>			
							<name>DPDFLAG</name>		
							<description>Deep power-down flag</description>		
							<bitRange>[11:11]</bitRange>		
							<enumeratedValues>		
								<name>ENUM</name>		
								<enumeratedValue>	
									<name>READ_DEEP_POWER_DOW</name>
									<description>Read: Deep power-down mode  not entered. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>	
								<enumeratedValue>	
									<name>READ_DEEP_POWER_DOW</name>
									<description>Read: Deep power-down mode entered. Write: Clear the Deep power-down flag.</description>
									<value>1</value>
								</enumeratedValue>	
							</enumeratedValues>		
						</field>			
						<field>			
							<name>RESERVED</name>		
							<description>Reserved. Do not write ones to this bit.</description>		
							<bitRange>[31:12]</bitRange>		
								
						</field>			
					</fields>				
				</register>					
				<register>					
					<dim>4</dim>				
					<dimIncrement>0x4</dimIncrement>				
					<dimIndex>0-3</dimIndex>				
					<name>GPREG%s</name>				
					<description>General purpose register 0</description>				
					<addressOffset>0x004</addressOffset>				
					<access>read-write</access>				
					<resetValue>0x0</resetValue>				
					<resetMask>0xFFFFFFFF</resetMask>				
					<fields>				
						<field>			
							<name>GPDATA</name>		
							<description>Data retained during Deep power-down mode.</description>		
							<bitRange>[31:0]</bitRange>		
						</field>			
					</fields>				
				</register>					
				<register>					
					<name>DPDCTRL</name>				
					<description>Deep power-down control register</description>				
					<addressOffset>0x014</addressOffset>				
					<access>read-write</access>				
					<resetValue>0x0</resetValue>				
					<resetMask>0xFFFFFFFF</resetMask>				
					<fields>				
						<field>			
							<name>WAKEUPHYS</name>		
							<description>WAKEUP pin hysteresis enable</description>		
							<bitRange>[0:0]</bitRange>		
							<enumeratedValues>		
								<name>ENUM</name>		
								<enumeratedValue>	
									<name>DISABLED_HYSTERESIS</name>
									<description>Disabled. Hysteresis for WAKUP pin disabled.</description>
									<value>0</value>
								</enumeratedValue>	
								<enumeratedValue>	
									<name>ENABLED_HYSTERESIS_</name>
									<description>Enabled. Hysteresis for WAKEUP pin enabled.</description>
									<value>1</value>
								</enumeratedValue>	
							</enumeratedValues>		
						</field>			
						<field>			
							<name>WAKEPAD_DISABLE</name>		
							<description>WAKEUP pin disable. Setting this bit disables the wake-up pin, so it can be used for other purposes. Never set this bit if you intend to use a pin to wake up the part from Deep power-down mode. You can only disable the wake-up pin if the self wake-up timer is enabled and configured. Setting this bit is not necessary if Deep power-down mode is not used.</description>		
							<bitRange>[1:1]</bitRange>		
							<enumeratedValues>		
								<name>ENUM</name>		
								<enumeratedValue>	
									<name>ENABLED_THE_WAKE_UP</name>
									<description>Enabled. The wake-up function is enabled on pin PIO0_4.</description>
									<value>0</value>
								</enumeratedValue>	
								<enumeratedValue>	
									<name>DISABLED_SETTING_TH</name>
									<description>Disabled. Setting this bit disables the wake-up function on pin PIO0_4.</description>
									<value>1</value>
								</enumeratedValue>	
							</enumeratedValues>		
						</field>			
						<field>			
							<name>LPOSCEN</name>		
							<description>Enable the low-power oscillator for use with the 10 kHz self wake-up timer clock. You must set this bit if the CLKSEL bit in the self wake-up timer CTRL bit is set.  Do not enable the low-power oscillator if the self wake-up timer is clocked by the divided IRC.</description>		
							<bitRange>[2:2]</bitRange>		
							<enumeratedValues>		
								<name>ENUM</name>		
								<enumeratedValue>	
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>	
								<enumeratedValue>	
									<name>ENABLED_</name>
									<description>Enabled.</description>
									<value>1</value>
								</enumeratedValue>	
							</enumeratedValues>		
						</field>			
						<field>			
							<name>LPOSCDPDEN</name>		
							<description>Enable the low-power oscillator in Deep power-down mode. Setting this bit causes the low-power oscillator to remain running during Deep power-down mode provided that bit 12 in this register is set as well.  You must set this bit for the self wake-up timer to be able to wake up the part from Deep power-down mode. Do not set this bit unless you must use the self wake-up timer to wake up from Deep power-down mode.</description>		
							<bitRange>[3:3]</bitRange>		
							<enumeratedValues>		
								<name>ENUM</name>		
								<enumeratedValue>	
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>	
								<enumeratedValue>	
									<name>ENABLED_</name>
									<description>Enabled.</description>
									<value>1</value>
								</enumeratedValue>	
							</enumeratedValues>		
						</field>			
						<field>			
							<name>RESERVED</name>		
							<description>Data retained during Deep power-down mode. or reserved?</description>		
							<bitRange>[31:4]</bitRange>		
								
