cmsis-svd/cmsis-svd/data/NXP/LPC800.svd
				</field>
				<field>
					<name>COMPSTAT</name>
					<description>Comparator status. This bit reflects the state of the comparator output.</description>
					<bitRange>[21:21]</bitRange>
					
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Write as 0.</description>
					<bitRange>[22:22]</bitRange>
					
				</field>
				<field>
					<name>COMPEDGE</name>
					<description>Comparator edge-detect status.</description>
					<bitRange>[23:23]</bitRange>
					
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Write as 0.</description>
					<bitRange>[24:24]</bitRange>
					
				</field>
				<field>
					<name>HYS</name>
					<description>Controls the hysteresis of the comparator. When the comparator is outputting a certain state, this is the difference between the selected signals, in the opposite direction from the state being output, that will switch the output.</description>
					<bitRange>[26:25]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NONE_THE_OUTPUT_WIL</name>
							<description>None (the output will switch as the voltages cross)</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>5_MV</name>
							<description>5 mV</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>10_MV</name>
							<description>10 mV</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>20_MV</name>
							<description>20 mV</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:27]</bitRange>
					
				</field>
			</fields>
		</register>
		<register>
			<name>LAD</name>
			<description>Voltage ladder register</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>LADEN</name>
					<description>Voltage ladder enable</description>
					<bitRange>[0:0]</bitRange>
					
				</field>
				<field>
					<name>LADSEL</name>
					<description>Voltage ladder value. The reference voltage Vref depends on the LADREF bit below. 00000 = VSS 00001 = 1 x Vref/31 00010 = 2 x Vref/31 ... 11111 = Vref</description>
					<bitRange>[5:1]</bitRange>
					
				</field>
				<field>
					<name>LADREF</name>
					<description>Selects the reference voltage Vref for the voltage ladder:</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SUPPLY_PIN_VDD</name>
							<description>Supply pin VDD</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>VDDCMP_PIN</name>
							<description>VDDCMP pin</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:7]</bitRange>
					
				</field>
			</fields>
		</register>
	</registers>
		</peripheral>
		
		<peripheral>
			<name>FLASHCTRL</name>
			<description> Flash controller </description>
			<groupName>FLASHCTRL</groupName>
			<baseAddress>0x40040000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>FLASH_IRQ</name>
				<value>14</value>
			</interrupt>
			<registers>												
				<register>											
					<name>FLASHCFG</name>										
					<description>Flash configuration register</description>										
					<addressOffset>0x010</addressOffset>										
					<access>read-write</access>										
					<resetValue>0</resetValue>										
					<resetMask>0x00000000</resetMask>										
					<fields>										
						<field>									
							<name>FLASHTIM</name>								
							<description>Flash memory access time. FLASHTIM +1 is equal to the number of system clocks used for flash access.</description>								
							<bitRange>[1:0]</bitRange>								
							<enumeratedValues>								
								<name>ENUM</name>								
								<enumeratedValue>							
									<name>1_SYSTEM_CLOCK_FLASH</name>						
									<description>1 system clock flash access time (for system clock frequencies of up to 20 MHz).</description>						
									<value>0x0</value>						
								</enumeratedValue>							
								<enumeratedValue>							
									<name>2_SYSTEM_CLOCKS_FLAS</name>						
									<description>2 system clocks flash access time (for system clock frequencies of up to 30 MHz).</description>						
									<value>0x1</value>						
								</enumeratedValue>							
								<enumeratedValue>							
									<name>RESERVED_</name>						
									<description>Reserved.</description>						
									<value>0x2</value>						
								</enumeratedValue>							
								<enumeratedValue>							
									<name>RESERVED_</name>						
									<description>Reserved.</description>						
									<value>0x3</value>						
								</enumeratedValue>							
							</enumeratedValues>								
						</field>									
						<field>									
							<name>RESERVED</name>								
							<description>Reserved. User software must not change the value of these bits. Bits 31:2 must be written back exactly as read.</description>								
							<bitRange>[31:2]</bitRange>								
														
						</field>									
					</fields>										
				</register>											
				<register>											
					<name>FMSSTART</name>										
					<description>Signature start address register</description>										
					<addressOffset>0x020</addressOffset>										
					<access>read-write</access>										
					<resetValue>0</resetValue>										
					<resetMask>0xFFFFFFFF</resetMask>										
					<fields>										
						<field>									
							<name>START</name>								
							<description>Signature generation start address (corresponds to AHB byte address bits[20:4]).</description>								
							<bitRange>[16:0]</bitRange>								
						</field>									
						<field>									
							<name>RESERVED</name>								
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>								
							<bitRange>[31:17]</bitRange>								
						</field>									
					</fields>										
				</register>											
				<register>											
					<name>FMSSTOP</name>										
					<description>Signature stop-address register</description>										
					<addressOffset>0x024</addressOffset>										
					<access>read-write</access>										
					<resetValue>0</resetValue>										
					<resetMask>0xFFFFFFFF</resetMask>										
					<fields>										
						<field>									
							<name>STOPA</name>								
							<description>Stop address for signature generation (the word specified by STOPA is included in the address range). The address is in units of memory words, not bytes.  If the option bistprotection=1, bits 2:0 cannot be written and are forced to 111.</description>								
							<bitRange>[16:0]</bitRange>								
														
