cmsis-svd/cmsis-svd/data/NXP/LPC800.svd
				</field>
				<field>
					<name>OD</name>
					<description>Open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>DISABLE_</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_MODE_ENAB</name>
							<description>Open-drain mode enabled.  This is not a true open-drain mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>S_MODE</name>
					<description>Digital filter sample mode.</description>
					<bitRange>[12:11]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>BYPASS_INPUT_FILTER_</name>
							<description>Bypass input filter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1_CLOCK_CYCLE_INPUT</name>
							<description>1 clock cycle. Input pulses shorter than one filter clock are rejected.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_CLOCK_CYCLES_INPU</name>
							<description>2 clock cycles. Input pulses shorter than two filter clocks are rejected.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>3_CLOCK_CYCLES_INPU</name>
							<description>3 clock cycles. Input pulses shorter than three filter clocks are rejected.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLK_DIV</name>
					<description>Select peripheral clock divider for input filter sampling clock. Value 0x7 is reserved.</description>
					<bitRange>[15:13]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>IOCONFILTRCLKDIV0_</name>
							<description>IOCONFILTRCLKDIV0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFILTRCLKDIV1_</name>
							<description>IOCONFILTRCLKDIV1.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFILTRCLKDIV2_</name>
							<description>IOCONFILTRCLKDIV2.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFILTRCLKDIV3_</name>
							<description>IOCONFILTRCLKDIV3.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFILTRCLKDIV4_</name>
							<description>IOCONFILTRCLKDIV4.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFILTRCLKDIV5_</name>
							<description>IOCONFILTRCLKDIV5.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONFILTRCLKDIV6_</name>
							<description>IOCONFILTRCLKDIV6.</description>
							<value>0x6</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
					
				</field>
			</fields>
		</register>
										
										
	</registers>
</peripheral>


		<peripheral>
			<name>SYSCON</name>
			<description>System configuration (SYSCON)</description>
			<groupName>SYSCON</groupName>
			<baseAddress>0x40048000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>BOD</name>
				<value>13</value>
			</interrupt>
		<registers>						
	<register>					
		<name>SYSMEMREMAP</name>				
		<description>System memory remap</description>				
		<addressOffset>0x000</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x2</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>MAP</name>		
				<description>System memory remap. Value 0x3 is reserved.</description>		
				<bitRange>[1:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>BOOT_LOADER_MODE_IN</name>
						<description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>USER_RAM_MODE_INTER</name>
						<description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>USER_FLASH_MODE_INT</name>
						<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
						<value>0x2</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:2]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PRESETCTRL</name>				
		<description>Peripheral reset control</description>				
		<addressOffset>0x004</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x00001FFF</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>SPI0_RST_N</name>		
				<description>SPI0 reset control</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_SPI0_RESE</name>
						<description>Assert the SPI0 reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_SPI0_RESET</name>
						<description>Clear the SPI0 reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>SPI1_RST_N</name>		
				<description>SPI1 reset control</description>		
				<bitRange>[1:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_SPI1_RESE</name>
						<description>Assert the SPI1 reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_SPI1_RESET</name>
						<description>Clear the SPI1 reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>UARTFRG_RST_N</name>		
				<description>UART fractional baud rate generator (UARTFRG) reset control</description>		
				<bitRange>[2:2]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_UARTFRG_R</name>
						<description>Assert the UARTFRG reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_UARTFRG_RE</name>
						<description>Clear the UARTFRG reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>USART0_RST_N</name>		
				<description>USART0 reset control</description>		
				<bitRange>[3:3]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_USART0_RE</name>
						<description>Assert the USART0 reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_USART0_RES</name>
						<description>Clear the USART0 reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>UART1_RST_N</name>		
				<description>U1ART1 reset control</description>		
				<bitRange>[4:4]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_UART_RESE</name>
						<description>Assert the UART reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_UART1_RESE</name>
						<description>Clear the UART1 reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>UART2_RST_N</name>		
				<description>UART2 reset control</description>		
				<bitRange>[5:5]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_UART2_RES</name>
						<description>Assert the UART2 reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_UART2_RESE</name>
						<description>Clear the UART2 reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>I2C_RST_N</name>		
				<description>I2C reset control</description>		
				<bitRange>[6:6]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_I2C_RESET</name>
						<description>Assert the I2C reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_I2C_RESET_</name>
						<description>Clear the I2C reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>MRT_RST_N</name>		
				<description>Multi-rate timer (MRT) reset control</description>		
				<bitRange>[7:7]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_MRT_RESET</name>
						<description>Assert the MRT reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_MRT_RESET_</name>
						<description>Clear the MRT reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>SCT_RST_N</name>		
				<description>SCT reset control</description>		
				<bitRange>[8:8]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_SCT_RESET</name>
						<description>Assert the SCT reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_SCT_RESET_</name>
						<description>Clear the SCT reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>WKT_RST_N</name>		
				<description>Self wake-up timer (WKT) reset control</description>		
				<bitRange>[9:9]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_WKT_RESET</name>
						<description>Assert the WKT reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_WKT_RESET_</name>
						<description>Clear the WKT reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>GPIO_RST_N</name>		
				<description>GPIO and GPIO pin interrupt reset control</description>		
				<bitRange>[10:10]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_GPIO_RESE</name>
						<description>Assert the GPIO reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_GPIO_RESET</name>
						<description>Clear the GPIO reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>FLASH_RST_N</name>		
				<description>Flash controller reset control</description>		
				<bitRange>[11:11]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_FLASH_CON</name>
						<description>Assert the flash controller reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_FLASH_CONT</name>
						<description>Clear the flash controller reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>ACMP_RST_N</name>		
				<description>Analog comparator reset control</description>		
				<bitRange>[12:12]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ASSERT_THE_ANALOG_CO</name>
						<description>Assert the analog comparator reset.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLEAR_THE_ANALOG_COM</name>
						<description>Clear the analog comparator controller reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:12]</bitRange>		
					
