cmsis-svd/cmsis-svd/data/NXP/LPC800.svd
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>SYSRSTSTAT</name>				
		<description>System reset status register</description>				
		<addressOffset>0x030</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>POR</name>		
				<description>POR reset status</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_POR_DETECTED</name>
						<description>No POR detected</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POR_DETECTED_WRITIN</name>
						<description>POR detected. Writing a one clears this reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>EXTRST</name>		
				<description>Status of the external RESET pin. External reset status.</description>		
				<bitRange>[1:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_RESET_EVENT_DETEC</name>
						<description>No reset event detected.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RESET_DETECTED_WRIT</name>
						<description>Reset detected. Writing a one clears this reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>WDT</name>		
				<description>Status of the Watchdog reset</description>		
				<bitRange>[2:2]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_WDT_RESET_DETECTE</name>
						<description>No WDT reset detected</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>WDT_RESET_DETECTED_</name>
						<description>WDT reset detected. Writing a one clears this reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>BOD</name>		
				<description>Status of the Brown-out detect reset</description>		
				<bitRange>[3:3]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_BOD_RESET_DETECTE</name>
						<description>No BOD reset detected</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>BOD_RESET_DETECTED_</name>
						<description>BOD reset detected. Writing a one clears this reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>SYSRST</name>		
				<description>Status of the software system reset</description>		
				<bitRange>[4:4]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_SYSTEM_RESET_DETE</name>
						<description>No System reset detected</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>SYSTEM_RESET_DETECTE</name>
						<description>System reset detected. Writing a one clears this reset.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:5]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>SYSPLLCLKSEL</name>				
		<description>System PLL clock source select</description>				
		<addressOffset>0x040</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>SEL</name>		
				<description>System PLL clock source</description>		
				<bitRange>[1:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>IRC</name>
						<description>IRC</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CRYSTAL_OSCILLATOR_</name>
						<description>Crystal Oscillator (SYSOSC)</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RESERVED_</name>
						<description>Reserved.</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>CLKIN_EXTERNAL_CLOC</name>
						<description>CLKIN. External clock input.</description>
						<value>0x3</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:2]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>SYSPLLCLKUEN</name>				
		<description>System PLL clock source update enable</description>				
		<addressOffset>0x044</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>ENA</name>		
				<description>Enable system PLL clock source update</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_CHANGE</name>
						<description>No change</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>UPDATE_CLOCK_SOURCE</name>
						<description>Update clock source</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:1]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>MAINCLKSEL</name>				
		<description>Main clock source select</description>				
		<addressOffset>0x070</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>SEL</name>		
				<description>Clock source for main clock</description>		
				<bitRange>[1:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>IRC_OSCILLATOR</name>
						<description>IRC Oscillator</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>PLL_INPUT</name>
						<description>PLL input</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>WATCHDOG_OSCILLATOR</name>
						<description>Watchdog oscillator</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>PLL_OUTPUT</name>
						<description>PLL output</description>
						<value>0x3</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:2]</bitRange>		
					
