cmsis-svd/cmsis-svd/data/NXP/LPC800.svd
			</field>			
			<field>			
				<name>SYSOSC_PD</name>		
				<description>Crystal oscillator wake-up configuration</description>		
				<bitRange>[5:5]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>WDTOSC_PD</name>		
				<description>Watchdog oscillator wake-up configuration. Changing this bit to powered-down has no effect when the LOCK bit in the WWDT MOD register is set. In this case, the watchdog oscillator is always running.</description>		
				<bitRange>[6:6]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>SYSPLL_PD</name>		
				<description>System PLL wake-up configuration</description>		
				<bitRange>[7:7]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Always write these bits as 0b1101</description>		
				<bitRange>[11:8]</bitRange>		
					
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Always write these bits as 0b110</description>		
				<bitRange>[14:12]</bitRange>		
					
			</field>			
			<field>			
				<name>ACMP</name>		
				<description>Analog comparator wake-up configuration</description>		
				<bitRange>[15:15]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:16]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PDRUNCFG</name>				
		<description>Power configuration register</description>				
		<addressOffset>0x238</addressOffset>				
		<access>read-write</access>				
		<resetValue>0xEDF0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>IRCOUT_PD</name>		
				<description>IRC oscillator output power</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>IRC_PD</name>		
				<description>IRC oscillator power down</description>		
				<bitRange>[1:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>FLASH_PD</name>		
				<description>Flash power down</description>		
				<bitRange>[2:2]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>BOD_PD</name>		
				<description>BOD power down</description>		
				<bitRange>[3:3]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[4:4]</bitRange>		
					
			</field>			
			<field>			
				<name>SYSOSC_PD</name>		
				<description>Crystal oscillator power down</description>		
				<bitRange>[5:5]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>WDTOSC_PD</name>		
				<description>Watchdog oscillator power down. Changing this bit to powered-down has no effect when the LOCK bit in the WWDT MOD register is set. In this case, the watchdog oscillator is always running.</description>		
				<bitRange>[6:6]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>SYSPLL_PD</name>		
				<description>System PLL power down</description>		
				<bitRange>[7:7]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Always write these bits as 0b1101</description>		
				<bitRange>[11:8]</bitRange>		
					
