cmsis-svd/cmsis-svd/data/NXP/LPC800.svd
				</field>
				<field>
					<name>SLVDESELEN</name>
					<description>Slave Deselect interrupt Enable.</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_SLVDESEL_INTERRU</name>
							<description>The SlvDeSel interrupt is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_SLVDESEL_INTERRU</name>
							<description>The SlvDeSel interrupt is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MONRDYEN</name>
					<description>Monitor data Ready interrupt Enable.</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_MONRDY_INTERRUPT</name>
							<description>The MonRdy interrupt is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_MONRDY_INTERRUPT</name>
							<description>The MonRdy interrupt is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MONOVEN</name>
					<description>Monitor Overrun interrupt Enable.</description>
					<bitRange>[17:17]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_MONOV_INTERRUPT_</name>
							<description>The MonOv interrupt is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_MONOV_INTERRUPT_</name>
							<description>The MonOv interrupt is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[18:18]</bitRange>
					
				</field>
				<field>
					<name>MONIDLEEN</name>
					<description>Monitor Idle interrupt Enable.</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_MONIDLE_INTERRUP</name>
							<description>The MonIdle interrupt is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_MONIDLE_INTERRUP</name>
							<description>The MonIdle interrupt is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[23:20]</bitRange>
					
				</field>
				<field>
					<name>EVENTTIMEOUTEN</name>
					<description>Event Timeout interrupt Enable.</description>
					<bitRange>[24:24]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_EVENT_TIMEOUT_IN</name>
							<description>The Event Timeout interrupt is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_EVENT_TIMEOUT_IN</name>
							<description>The Event Timeout interrupt is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCLTIMEOUTEN</name>
					<description>SCL Timeout interrupt Enable.</description>
					<bitRange>[25:25]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_SCL_TIMEOUT_INTE</name>
							<description>The SCL Timeout interrupt is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_SCL_TIMEOUT_INTE</name>
							<description>The SCL Timeout interrupt is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:26]</bitRange>
					
				</field>
			</fields>
		</register>
		<register>
			<name>INTENCLR</name>
			<description>Interrupt Enable Clear register.</description>
			<addressOffset>0x0C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>MSTPENDINGCLR</name>
					<description>Master Pending interrupt clear. Writing 1 to this bit clears the corresponding bit in the INTENSET register if implemented.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[3:1]</bitRange>
				</field>
				<field>
					<name>MSTARBLOSSCLR</name>
					<description>Master Arbitration Loss interrupt clear.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>MSTSTSTPERRCLR</name>
					<description>Master Start/Stop Error interrupt clear.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>SLVPENDINGCLR</name>
					<description>Slave Pending interrupt clear.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[10:9]</bitRange>
				</field>
				<field>
					<name>SLVNOTSTRCLR</name>
					<description>Slave Not Stretching interrupt clear.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[14:12]</bitRange>
				</field>
				<field>
					<name>SLVDESELCLR</name>
					<description>Slave Deselect interrupt clear.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>MONRDYCLR</name>
					<description>Monitor data Ready interrupt clear.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>MONOVCLR</name>
					<description>Monitor Overrun interrupt clear.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>MONIDLECLR</name>
					<description>Monitor Idle interrupt clear.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[23:20]</bitRange>
				</field>
				<field>
					<name>EVENTTIMEOUTCLR</name>
					<description>Event Timeout interrupt clear.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>SCLTIMEOUTCLR</name>
					<description>SCL Timeout interrupt clear.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:26]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TIMEOUT</name>
			<description>Time-out value register.</description>
			<addressOffset>0x10</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TOMIN</name>
					<description>Timeout time value, bottom four bits. These are hard-wired to 0xF. This gives a minimum timeout of 16 I2C function clocks and also a timeout resolution of 16 I2C function clocks.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>TO</name>
					<description>Timeout time value. Specifies the timeout interval value in increments of 16 I2C function clocks, as defined by the CLKDIV register. To change this value while I2C is in operation, disable all time-outs, write a new value to TIMEOUT, then re-enable time-outs. 0x000 = A time-out will occur after 16 counts of the I2C function clock. 0x001 = A time-out will occur after 32 counts of the I2C function clock. ... 0xFFF = A timeout will occur after 65,536 counts of the I2C function clock.</description>
					<bitRange>[15:4]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DIV</name>
			<description>Clock pre-divider for the entire I2C block. This determines what time increments are used for the MSTTIME and SLVTIME registers.</description>
			<addressOffset>0x14</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIVVAL</name>
					<description>This field controls how the clock (PCLK) is used by the I2C functions that need an internal clock in order to operate. 0x0000 = PCLK is used directly by the I2C function. 0x0001 = PCLK is divided by 2 before use by the I 2C function. 0x0002 = PCLK is divided by 3 before use by the I 2C function. ... 0xFFFF = PCLK is divided by 65,536 before use by the I2C function.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>INTSTAT</name>
			<description>Interrupt Status register for Master, Slave, and Monitor functions.</description>
			<addressOffset>0x18</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSTPENDING</name>
					<description>Master Pending.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[3:1]</bitRange>
				</field>
				<field>
					<name>MSTARBLOSS</name>
					<description>Master Arbitration Loss flag.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>MSTSTSTPERR</name>
					<description>Master Start/Stop Error flag.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>SLVPENDING</name>
					<description>Slave Pending.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[10:9]</bitRange>
				</field>
				<field>
					<name>SLVNOTSTR</name>
					<description>Slave Not Stretching status.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[14:12]</bitRange>
				</field>
				<field>
					<name>SLVDESEL</name>
					<description>Slave Deselected flag.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>MONRDY</name>
					<description>Monitor Ready.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>MONOV</name>
					<description>Monitor Overflow flag.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>MONIDLE</name>
					<description>Monitor Idle flag.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[23:20]</bitRange>
				</field>
				<field>
					<name>EVENTTIMEOUT</name>
					<description>Event Timeout Interrupt flag.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>SCLTIMEOUT</name>
					<description>SCL Timeout Interrupt flag.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:26]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MSTCTL</name>
			<description>Master control register.</description>
			<addressOffset>0x20</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSTCONTINUE</name>
					<description>Master Continue. This bit is write-only.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EFFECT_</name>
							<description>No effect.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CONTINUE_INFORMS_TH</name>
							<description>Continue. Informs the Master function to continue to the next operation. This must done after writing transmit data, reading received data, or any other housekeeping related to the next bus operation.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MSTSTART</name>
					<description>Master Start control. This bit is write-only.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EFFECT_</name>
							<description>No effect.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>START_A_START_WILL_</name>
							<description>Start. A Start will be generated on the I2C bus at the next allowed time.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MSTSTOP</name>
					<description>Master Stop control. This bit is write-only.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EFFECT_</name>
							<description>No effect.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STOP_A_STOP_WILL_BE</name>
							<description>Stop. A Stop will be generated on the I2C bus at the next allowed time, preceded by a Nack to the slave if the master is receiving data from the slave (Master Receiver mode).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:2]</bitRange>
					
