cmsis-svd/cmsis-svd/data/NXP/LPC800.svd
				</field>					
				<field>					
					<name>MATCHMEM</name>				
					<description>If this bit is one and the COMBMODE field specifies a match  component to the triggering of this event, then a match is considered to be active whenever the counter value is  GREATER THAN OR EQUAL TO the value specified in the  match register when counting up, LESS THEN OR EQUAL TO  the match value when counting down. If this bit is zero, a match is only be active during the cycle  when the counter is equal to the match value.</description>				
					<bitRange>[20:20]</bitRange>				
					
				</field>					
				<field>					
					<name>DIRECTION</name>				
					<description>Direction qualifier for event generation. This field only applies when the counters are operating in BIDIR  mode. If BIDIR = 0, the SCT ignores this field. Value 0x3 is reserved.</description>				
					<bitRange>[22:21]</bitRange>				
					<enumeratedValues>				
						<name>ENUM</name>				
						<enumeratedValue>			
							<name>DIRECTION_INDEPENDEN</name>		
							<description>Direction independent. This event is triggered regardless of the count direction.</description>		
							<value>0x0</value>		
						</enumeratedValue>			
						<enumeratedValue>			
							<name>COUNTING_UP_THIS_EV</name>		
							<description>Counting up. This event is triggered only during up-counting when BIDIR = 1.</description>		
							<value>0x1</value>		
						</enumeratedValue>			
						<enumeratedValue>			
							<name>COUNTING_DOWN_THIS_</name>		
							<description>Counting down. This event is triggered only during down-counting when BIDIR = 1.</description>		
							<value>0x2</value>		
						</enumeratedValue>			
					</enumeratedValues>				
				</field>					
				<field>					
					<name>RESERVED</name>				
					<description>Reserved</description>				
					<bitRange>[31:23]</bitRange>				
					
				</field>					
			</fields>						
		</register>	
		<register>
			
			<name>EV4_STATE</name>
			<description>SCT event state register 4</description>
			<addressOffset>0x320</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STATEMSKm</name>
					<description>If bit m is one, event n (n= 0 to 5) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1).</description>
					<bitRange>[1:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>							
			
			<name>EV4_CTRL</name>						
			<description>SCT event control register 4</description>						
			<addressOffset>0x324</addressOffset>						
			<access>read-write</access>						
			<resetValue>0x00000000</resetValue>						
			<resetMask>0xFFFFFFFF</resetMask>						
			<fields>						
				<field>					
					<name>MATCHSEL</name>				
					<description>Selects the Match register associated with this event (if any). A  match can occur only when the counter selected by the HEVENT  bit is running.</description>				
					<bitRange>[3:0]</bitRange>				
					
				</field>					
				<field>					
					<name>HEVENT</name>				
					<description>Select L/H counter. Do not set this bit if UNIFY = 1.</description>				
					<bitRange>[4:4]</bitRange>				
					<enumeratedValues>				
						<name>ENUM</name>				
						<enumeratedValue>			
							<name>SELECTS_THE_L_STATE_</name>		
							<description>Selects the L state and the L match register selected by MATCHSEL.</description>		
							<value>0</value>		
						</enumeratedValue>			
						<enumeratedValue>			
							<name>SELECTS_THE_H_STATE_</name>		
							<description>Selects the H state and the H match register selected by MATCHSEL.</description>		
							<value>1</value>		
						</enumeratedValue>			
					</enumeratedValues>				
				</field>					
				<field>					
					<name>OUTSEL</name>				
					<description>Input/output select</description>				
					<bitRange>[5:5]</bitRange>				
					<enumeratedValues>				
						<name>ENUM</name>				
						<enumeratedValue>			
							<name>SELECTS_THE_INPUTS_E</name>		
							<description>Selects the inputs elected by IOSEL.</description>		
							<value>0</value>		
						</enumeratedValue>			
						<enumeratedValue>			
							<name>SELECTS_THE_OUTPUTS_</name>		
							<description>Selects the outputs selected by IOSEL.</description>		
							<value>1</value>		
						</enumeratedValue>			
					</enumeratedValues>				
				</field>					
				<field>					
					<name>IOSEL</name>				
					<description>Selects the input or output signal associated with this event (if  any). Do not select an input in this register, if CKMODE is 1x. In this case the clock input is an implicit ingredient of  every event.</description>				
					<bitRange>[9:6]</bitRange>				
					
				</field>					
				<field>					
					<name>IOCOND</name>				
					<description>Selects the I/O condition for event n. (The detection of edges on outputs lag the conditions that switch the outputs by one SCT clock). In order to guarantee proper edge/state detection, an input must have a minimum pulse width of at least one SCT  clock period .</description>				
					<bitRange>[11:10]</bitRange>				
					<enumeratedValues>				
						<name>ENUM</name>				
						<enumeratedValue>			
							<name>LOW</name>		
							<description>LOW</description>		
							<value>0x0</value>		
						</enumeratedValue>			
						<enumeratedValue>			
							<name>RISE</name>		
							<description>Rise</description>		
							<value>0x1</value>		
						</enumeratedValue>			
						<enumeratedValue>			
							<name>FALL</name>		
							<description>Fall</description>		
							<value>0x2</value>		
						</enumeratedValue>			
						<enumeratedValue>			
							<name>HIGH</name>		
							<description>HIGH</description>		
							<value>0x3</value>		
						</enumeratedValue>			
					</enumeratedValues>				
				</field>					
				<field>					
					<name>COMBMODE</name>				
					<description>Selects how the specified match and I/O condition are used and combined.</description>				
					<bitRange>[13:12]</bitRange>				
					<enumeratedValues>				
						<name>ENUM</name>				
						<enumeratedValue>			
							<name>OR_THE_EVENT_OCCURS</name>		
							<description>OR. The event occurs when either the specified match or I/O condition occurs.</description>		
							<value>0x0</value>		
						</enumeratedValue>			
						<enumeratedValue>			
							<name>MATCH_USES_THE_SPEC</name>		
							<description>MATCH. Uses the specified match only.</description>		
							<value>0x1</value>		
						</enumeratedValue>			
						<enumeratedValue>			
							<name>IO_USES_THE_SPECIFI</name>		
							<description>IO. Uses the specified I/O condition only.</description>		
							<value>0x2</value>		
						</enumeratedValue>			
						<enumeratedValue>			
							<name>AND_THE_EVENT_OCCUR</name>		
							<description>AND. The event occurs when the specified match and I/O condition occur simultaneously.</description>		
							<value>0x3</value>		
						</enumeratedValue>			
					</enumeratedValues>				
				</field>					
				<field>					
					<name>STATELD</name>				
					<description>This bit controls how the STATEV value modifies the state  selected by HEVENT when this event is the highest-numbered  event occurring for that state.</description>				
					<bitRange>[14:14]</bitRange>				
					<enumeratedValues>				
						<name>ENUM</name>				
						<enumeratedValue>			
							<name>STATEV_VALUE_IS_ADDE</name>		
							<description>STATEV value is added into STATE (the carry-out is ignored).</description>		
							<value>0</value>		
						</enumeratedValue>			
						<enumeratedValue>			
							<name>STATEV_VALUE_IS_LOAD</name>		
							<description>STATEV value is loaded into STATE.</description>		
							<value>1</value>		
						</enumeratedValue>			
					</enumeratedValues>				
				</field>					
				<field>					
					<name>STATEV</name>				
					<description>This value is loaded into or added to the state selected by  HEVENT, depending on STATELD, when this event is the  highest-numbered event occurring for that state. If STATELD and  STATEV are both zero, there is no change to the STATE value.</description>				
					<bitRange>[19:15]</bitRange>				
					
